import { Text } from "@mantine/core";

export default function InfoPage() {
  return (
    <div className="flex flex-col gap-5">
      <Text fw={700} size="xl">
        ประวัติโรงนม มหาวิทยาลัยเกษตรศาสตร์ โรงนมเกษตรกับย่างก้าวขึ้นสู่ปีที่ 60
      </Text>
      <Text>
        ในปี พ.ศ.2495 ทางมหาวิทยาลัยเกษตรศาสตร์ได้สั่งโคนมพันธุ์เจอซี่ เพศผู้ 2
        ตัว เพศเมีย 6 ตัว จากประเทศออสเตรเลีย เข้ามาเลี้ยงไว้ที่เกษตรกลาง บางเขน
        โดยศาสตราจารย์ หม่อมราชวงศ์ ชวนิศนดากรวรวรรณ (ส่วนใหญ่มักเรียกท่านว่า
        อาจารย์หม่อม) ได้สำเร็จการศึกษาและฝึกอบรมด้านโคนมจากประเทศออสเตรเลียจึง
        เป็นผู้ดูแลโคด้วยตนเองระหว่างการเดินทางขนย้ายจากประเทศออสเตรเลียมายั
        ประเทศไทย โคนมที่นำเข้ามาในขณะนั้นเป็นโคพ่อพันธุ์ 2 ตัว
        และโคแม่พันธุ์อีก 5 ตัว ซึ่ง
        โคทั้งหมดนี้ได้เข้ามาเก็บกักไว้ที่คอกชั่วคราว
        ตรงบริเวณคณะวิศวกรรมศาสตร์ใน ปัจจุบัน โดยมี ผศ. ทองยศ อเนกะเวียง
        เป็นเทรนมีคนแรกที่ช่วยดูแลโคเหล่านั้น หลัง
        จากนั้นการเรียนการสอนเกี่ยวกับวิชาการเลี้ยงโคนมและผลิตภัณฑ์นมของภาควิชา
        สัตวบาลก็เริ่มต้นตั้งแต่บัดนั้น
      </Text>
      <Text>
        เมื่อมีการเลี้ยงโคนมเกิดขึ้น ก็มีการส่งเสริมการบริโภคนม
        โดยในระยะแรกๆนั้น โรงนมเกษตรได้รับนํ้านม
        สดจากเกษตรกรรายย่อยที่มาขอรับบริการส่งเสริมจากอาจารย์หม่อมซึ่งส่วนใหญ่เป็นฟาร์มโคนมของชาวอินดูที่
        อาจารย์สามารถเข้าไปควบคุมความสะอาดโดยเฉพาะสุขภาพสัตว์ได้
        นอกจากนั้นฟาร์มโคนมไทย-เดนมาร์ค (อ.ส.ค. ในปัจจุบัน)
        ก็ส่งนมสดมาเข้าขบวนการผลิตอีกในระหว่างปี พ.ศ. 2504-2505
        อีกทั้งอาจารย์หม่อมยังช่วย เหลือในการจัดตั้งสหกรณ์โคนมอยุธยา
        ซึ่งต่อมาป่านมบางส่วนมาจากสหกรณ์โคนมอยุธยาและบางครั้งจาก
        สหกรณ์โคนมหนองโพก็ส่งเข้ามาผลิตที่โรจนมเกษตร
      </Text>
      <Text>
        เมื่อมีการเลี้ยงโคนมและการส่งเสริมการเลี้ยงโคนมแพร่กระจายไป
        ทําให้ความต้องการนํ้านมเพิ่มขึ้น
        วิชาสัตวบาลในขณะนั้นก็มีแค่หม้อพาสเจอร์ไรส์นมขนาดเล็กไม่กี่สิบลิตร
        และได้ทดลองทำไอศกรีมหลาก ภาค หลายรสชาติ
        ผลิตภัณฑ์นมเหล่านี้มีวางจำหน่ายในมหาวิทยาลัยเท่านั้น
        นี่คือจุดกำเนิดโรงนมมหาวิทยาลัย เกษตรศาสตร์แม้ว่ามหาวิทยาลัยในขณะนั้น
        จะไม่มีเงินจนประมาณและนโยบายที่ลงทุนในการจัดตั้งโรงงาน นมทันสมัย
        เพื่อใช้ประกอบการเรียนการสอนของนิสิต
        แต่การผลิตนมของมหาวิทยาลัยเกษตรศาสตร์ยังดำเนิน
        การต่อไปเพื่อส่งเสริมการบริโภคให้เพิ่มมากขึ้นอาจารย์หม่อมได้เริ่มก่อสร้างโรงเรือนอาคารและ
        ติดตั้งเครื่องจักรสำหรับการผลิตนมพาสเจอร์ไรส์
        โดยได้รับความช่วยเหลือจากรัฐบาลออสเตรเลียภายใต้แผน โคลัมโบ เมื่อวันที่
        12 กุมภาพันธ์ พ.ศ. 2506 โดยฯพณฯ
        ท่านเอกอัครราชทูตออสเตรเลียประจำประเทศไทยได้เดิน
        ทางมาเป็นประธานในพิธีมอบเครื่องพาสเจอร์ไรซ์นํ้านมระบบ
        แผ่นแลกเปลี่ยนความร้อน (Plate Heat Exchanger, PHE)
        เครื่องแรกของประเทศไทย จากบริษัท APV ประเทศออสเตรเลีย
        ซึ่งเป็นเครื่องที่ทันสมัยที่สุดในขณะนั้น โดย มีกำลังการผลิต 1
        ต้นต่อชั่วโมง ให้แก่ทางมหาวิทยาลัยเกษตรศาสตร์
        เพื่อเป็นประโยชน์ทางด้านการศึกษา
      </Text>
      <Text>
        นับได้ว่าเป็นโรงงานแปรรูปผลิตภัณฑ์นมแห่งแรกที่ทันสมัยที่สุดของประเทศไทย
        ในชื่อ"โรงนมภาควิชา สัตวบาลมหาวิทยาลัยเกษตรศาสตร์"
        แต่คนทั่วไปมักเรียกว่า "โรงนมเกษตร" ทําให้มหาวิทยาลัย เกษตรศาสตร์
        ได้รับชื่อเสียงเป็นที่รู้จักกันทั่วไปในฐานะเป็นแหล่งของการผลิตนม
        และผลิตภัณฑ์นมที่มีคุณภาพเป็นที่ไว้ใจได้
        และเป็นส่วนสำคัญที่ทำให้ความนิยมดื่มนมสดของประชาชนเริ่มแพร่หลาย
        ซึ่งต่อมาได้ทำให้เกิดโรงงานผลิตนม ขนาดใหญ่ขึ้นหลายแห่ง
        ดังที่เห็นอยู่ในปัจจุบันนี้
      </Text>
      <Text>
        โรงนมเกษตร :
        ผู้บุกเบิกรณรงค์เพื่อการบริโภคนมสดและห้องปฏิบัติการนํ้านมในสมัยที่อาจารย์หม่อม
        ดูแลกิจการฟาร์มโคนมนั้น คนไทยยังดื่มนมสดกันน้อยมาก ยมากคือพ คือ
        พออดนมแม่ก็รู้จักแต่นมข้นหวาน จะเริ่มดื่มนม อีกครั้งก็ตอนโตแล้ว
        ซึ่งมักพบปัญญาเรื่องท้องเดิน เพราะไม่สามารถย่อยน้ำตาลแลคโตสได้
        นอกจากนั้นราคา นมก็แพงอีกด้วย
      </Text>
      <Text>
        แต่ด้วยความเป็นนักคิดริเริ่มของอาจารย์หม่อม ซึ่ง ดร.สุนทราภรณ์ รัตนดิลก
        ณ ภูเก็ต ได้เล่าว่า "เดรี่ฮัท" และ "เดรี่ควีน" ได้ถูกสร้างขึ้นโดยมี
        อาจารย์สมเกียรติ ทีมพัฒนพงษ์ เป็นคนออกแบบร้านตอนแรกขายแต่นม เนย
        และไอสครีมเท่านั้น แต่ก็เป็นผลิตภัณฑ์จากโรงนมเกษตร
        รวมทั้งจากห้องปฏิบัติการนมที่นิสิตได้เรียนรู้ โดยเฉพาะ ไอสครีมนั้น
        ได้รับคำชมจากคนในวังของท่านจักรพันธ์ (หม่อมเจ้าจักรพันธ์เพ็ญศิริ
        จักรพันธ์) อย่างไรก็ตาม การ เลี้ยงโคนม การส่งเสริมการเลี้ยงโคนม
        อุตสาหกรรมการผลิตนม รวมทั้งการส่งเสริมการดื่มนมเพื่อสุขภาพของ
        ประชาชนโดยเฉพาะโครงการนมโรงเรียน
        ได้เกิดอย่างเป็นระบบมาตั้งแต่เกิดโรงนมมหาวิทยาลัยเกษตรศาสตร์
        ทําให้เกิดความนิยมในการดื่มนมสดอย่างแพร่หลาย
        เกิดโรงงานแปรรูปน้ำนมขึ้นมาจนทำให้ผู้ซื้อมีโอกาสดื่มนมสด มากยิ่งขึ้น
      </Text>
    </div>
  );
}
